---
kind: type
id: T:Autodesk.Revit.DB.TilePatterns
source: html/de6a59b3-118e-f92f-0556-2e9a0727770f.htm
---
# Autodesk.Revit.DB.TilePatterns

The TilePatterns object is an interface for retrieving the TilePattern objects
within the Document.

## Syntax (C#)
```csharp
public class TilePatterns : APIObject
```